tap "buo/cask-upgrade"
tap "charmbracelet/tap"
tap "chipmk/tap"
tap "gphotosuploader/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "ivandokov/contrib"
tap "jakehilborn/jakehilborn"
tap "macos-fuse-t/cask"
tap "modularml/packages"
tap "oven-sh/bun"
brew "python@3.12"
brew "harfbuzz"
brew "age"
brew "aichat"
brew "atuin"
brew "bat"
brew "bfg"
brew "node"
brew "bitwarden-cli"
brew "blueutil"
brew "gcc"
brew "btop"
brew "certifi"
brew "chafa"
brew "chezmoi"
brew "lima"
brew "colima"
brew "coreutils"
brew "curl"
brew "ffmpeg"
brew "czkawka"
brew "deno"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "doggo"
brew "duf"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpegthumbnailer"
brew "fish"
brew "fisher"
brew "flyctl"
brew "fnm"
brew "freetds"
brew "fzf"
brew "geckodriver"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gitmoji"
brew "go"
brew "gum"
brew "handbrake"
brew "htop"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "ipython"
brew "jc"
brew "jq"
brew "jupyterlab"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "lftp"
brew "llvm"
brew "luajit"
brew "luarocks"
brew "mas"
brew "mkcert"
brew "mods"
brew "mpv"
brew "ncdu"
brew "ncspot"
brew "neo4j"
brew "neovim"
brew "nnn"
brew "nss"
brew "ollama"
brew "pgcli"
brew "pngpaste"
brew "poetry"
brew "poppler"
brew "postgresql@14"
brew "proctools"
brew "python-yq"
brew "qalculate-qt"
brew "redis"
brew "restic"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "rustup"
brew "rye"
brew "sad"
brew "sd"
brew "sevenzip"
brew "sleepwatcher"
brew "solo2-cli"
brew "sshpass"
brew "starship"
brew "tailscale"
brew "tailspin"
brew "tealdeer"
brew "tokei"
brew "topgrade"
brew "transmission-cli"
brew "unar"
brew "vhs"
brew "watch"
brew "watchexec"
brew "wget"
brew "yarn"
brew "yazi", args: ["HEAD"]
brew "zbar"
brew "zig"
brew "zoxide"
brew "charmbracelet/tap/freeze"
brew "gphotosuploader/tap/gphotos-uploader-cli"
brew "ivandokov/contrib/phockup"
brew "jakehilborn/jakehilborn/displayplacer"
brew "modularml/packages/modular"
brew "oven-sh/bun/bun"
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "basictex"
cask "calibre"
cask "discord"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "fuse-t"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "hyperkey"
cask "kitty"
cask "libreoffice"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "monitorcontrol"
cask "mullvadvpn"
cask "neo4j"
cask "obsidian"
cask "raycast"
cask "signal"
cask "slack"
cask "sonos"
cask "spotify"
cask "sqlcl"
cask "steam"
cask "swiftdefaultappsprefpane"
cask "visual-studio-code"
cask "zed"
mas "Bitwarden", id: 1352778147
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "TickTick", id: 966085870
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "adamcowley.neo4j-vscode"
vscode "alefragnani.bookmarks"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "humao.rest-client"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jakeboone02.cypher-query-language"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "neo4j-extensions.neo4j-for-vscode"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
