tap "buo/cask-upgrade"
tap "charmbracelet/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "macos-fuse-t/cask"
tap "mongodb/brew"
tap "nats-io/nats-tools"
tap "oven-sh/bun"
brew "python-setuptools"
brew "harfbuzz"
brew "age"
brew "aichat"
brew "certifi"
brew "gcc"
brew "python@3.12"
brew "aider"
brew "atuin"
brew "awscli"
brew "bash"
brew "bat"
brew "bfg"
brew "blueutil"
brew "node"
brew "bruno-cli"
brew "btop"
brew "chezmoi"
brew "cmake"
brew "lima"
brew "colima"
brew "coreutils"
brew "curl"
brew "ffmpeg"
brew "pkgconf"
brew "czkawka"
brew "deno"
brew "direnv"
brew "dive"
brew "docker-buildx"
brew "doggo"
brew "dua-cli"
brew "duckdb"
brew "duf"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpegthumbnailer"
brew "fish"
brew "fisher"
brew "flyctl"
brew "fnm"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gitmoji"
brew "go"
brew "gofumpt"
brew "golangci-lint-langserver"
brew "gum"
brew "handbrake"
brew "htop"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "ipython"
brew "jc"
brew "jq"
brew "pandoc"
brew "jupyterlab"
brew "k9s"
brew "kondo"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "llama.cpp"
brew "llvm"
brew "luajit"
brew "luarocks"
brew "mas"
brew "mongosh"
brew "mpv"
brew "neovim"
brew "nss"
brew "ollama"
brew "opentofu"
brew "ouch"
brew "pgcli"
brew "pipx"
brew "pngpaste"
brew "pnpm"
brew "poetry"
brew "poppler"
brew "portaudio"
brew "postgresql@17"
brew "proctools"
brew "python-yq"
brew "qalculate-qt"
brew "qemu"
brew "redis"
brew "restic"
brew "ripgrep"
brew "ripgrep-all"
brew "ruby"
brew "rye"
brew "sad"
brew "sd"
brew "sevenzip"
brew "solo2-cli"
brew "starship"
brew "tealdeer"
brew "television"
brew "tmux"
brew "tokei"
brew "topgrade"
brew "transmission-cli"
brew "unar"
brew "uv"
brew "vhs"
brew "watch"
brew "wget"
brew "yarn"
brew "yazi"
brew "zig"
brew "zoxide"
brew "hashicorp/tap/terraform"
brew "jakehilborn/jakehilborn/displayplacer"
brew "mongodb/brew/mongodb-database-tools"
brew "nats-io/nats-tools/nats"
brew "oven-sh/bun/bun"
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "basictex"
cask "bruno"
cask "calibre"
cask "chatgpt"
cask "cleanshot"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "fuse-t"
cask "ghostty"
cask "google-drive"
cask "homerow"
cask "jordanbaird-ice"
cask "libreoffice"
cask "monitorcontrol"
cask "obsidian"
cask "protonvpn"
cask "raycast"
cask "signal"
cask "slack"
cask "sonos"
cask "spotify"
cask "stats"
cask "steam"
cask "tableplus"
cask "tailscale"
cask "visual-studio-code"
cask "wireshark"
cask "zed@preview"
cask "zen"
mas "Bitwarden", id: 1352778147
mas "TickTick", id: 966085870
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "humao.rest-client"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
