tap "buo/cask-upgrade"
tap "charmbracelet/tap"
tap "chipmk/tap"
tap "gphotosuploader/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "ivandokov/contrib"
tap "jakehilborn/jakehilborn"
tap "macos-fuse-t/cask"
tap "modularml/packages"
tap "oven-sh/bun"
brew "python@3.12"
brew "harfbuzz"
brew "age"
brew "aichat"
brew "atuin"
brew "bat"
brew "bfg"
brew "node"
brew "bitwarden-cli"
brew "blueutil"
brew "btop"
brew "certifi"
brew "chafa"
brew "chezmoi"
brew "lima"
brew "colima"
brew "coreutils"
brew "curl"
brew "ffmpeg"
brew "czkawka"
brew "deno"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "doggo"
brew "duf"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpegthumbnailer"
brew "fish"
brew "fisher"
brew "flyctl"
brew "fnm"
brew "freetds"
brew "fzf"
brew "gcc"
brew "geckodriver"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gitmoji"
brew "go"
brew "gum"
brew "handbrake"
brew "htop"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "ipython"
brew "jc"
brew "jq"
brew "jupyterlab"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "lftp"
brew "llvm"
brew "luajit"
brew "luarocks"
brew "mas"
brew "mkcert"
brew "mods"
brew "mpv"
brew "ncdu"
brew "ncspot"
brew "neovim"
brew "nmap"
brew "nnn"
brew "nss"
brew "ollama"
brew "pgcli"
brew "pngpaste"
brew "poetry"
brew "poppler"
brew "postgresql@14"
brew "proctools"
brew "python-yq"
brew "qalculate-qt"
brew "redis"
brew "restic"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "rustup"
brew "rye"
brew "sad"
brew "sd"
brew "sevenzip"
brew "sleepwatcher", restart_service: true
brew "solo2-cli"
brew "sshpass"
brew "starship"
brew "tailspin"
brew "tealdeer"
brew "tokei"
brew "topgrade"
brew "transmission-cli"
brew "unar"
brew "vhs"
brew "watch"
brew "watchexec"
brew "wget"
brew "yarn"
brew "yazi", args: ["HEAD"]
brew "zbar"
brew "zig"
brew "zoxide"
brew "charmbracelet/tap/freeze"
brew "gphotosuploader/tap/gphotos-uploader-cli"
brew "ivandokov/contrib/phockup"
brew "jakehilborn/jakehilborn/displayplacer"
brew "modularml/packages/modular"
brew "oven-sh/bun/bun"
cask "1password"
cask "alt-tab"
cask "basictex"
cask "calibre"
cask "discord"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "fuse-t"
cask "google-chrome"
cask "google-drive"
cask "hyperkey"
cask "kitty"
cask "monitorcontrol"
cask "mullvadvpn"
cask "obsidian"
cask "raspberry-pi-imager"
cask "raycast"
cask "signal"
cask "slack"
cask "sonos"
cask "spotify"
cask "steam"
cask "swiftdefaultappsprefpane"
cask "tableplus"
cask "tailscale"
cask "wireshark"
cask "zed"
cask "zen-browser"
mas "Bitwarden", id: 1352778147
mas "TickTick", id: 966085870
mas "Xcode", id: 497799835
