PatrickF1/fzf.fish
danhper/fish-ssh-agent
franciscolourenco/done
jorgebucaran/autopair.fish
jorgebucaran/replay.fish
nickeb96/puffer-fish
catppuccin/fish
jorgebucaran/fisher
lgathy/google-cloud-sdk-fish-completion
